---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.ExpandDots
source: html/e64c2ae9-9c7d-412b-e4b1-3f3c084cf800.htm
---
# Autodesk.Revit.DB.FillPattern.ExpandDots Method

Corrects pattern dots to make them be drawn properly for Revit.

## Syntax (C#)
```csharp
public bool ExpandDots()
```

## Returns
Indicates whether any dots were in fact expanded.